package Cons_25_07;

public class Main {
    public static void main(String[] args) {
        /* Задача 1. Написать программу, определяющую, является ли целое число положительным,
        отрицательным или нулем и выводит результат на экран
        int x =
         */
        /* Задача 2. Есть три переменные целого типа. Написать программу, определяющую
        равны ли эти числа или нет. Программа должна выводить на экран следующие сообщения:
        "Все числа равны" - если они равны,
        "Все числа разные" -  если они разные,
        "Некоторые из чисел равны" - если какие-то равны
         */
        /* Задача 3. Есть три переменные целого типа x, y, z. Написать программу, определяющую
        их последовательность - если значения возрастают, то программа печатает
        increasing, если убывают (3,2,1) - decreasing, и "не убывают и не возрастают"
        во всех остальных случаях ( neither decreasing nor increasing)
         */



    }
}
